---
kind: method
id: M:Autodesk.Revit.DB.FormulaManager.GetFunctions
source: html/85ab1099-34fa-2804-c819-894b2c4e63d1.htm
---
# Autodesk.Revit.DB.FormulaManager.GetFunctions Method

Gets list of function names supported by formula engine

## Syntax (C#)
```csharp
public static IList<string> GetFunctions()
```